scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# *valid_score, b, c  = scores
*valid_score, _, _  = scores
print(valid_score)

print("----------------------------------------------------------------")
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
a, *valid_score, c = scores
print(valid_score)

print("----------------------------------------------------------------")
temp = { } # or temp = {}

print("----------------------------------------------------------------")
temp = {"메로나" : 1000, "폴라포" : 1200, "빵빠레" : 1800}
print(temp)
temp["죠스바"] = 1200
temp["월드콘"] = 1500
print(temp)

print("----------------------------------------------------------------")
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}

print("메로나 가격 : ", ice["메로나"])
# print("메로나 가격 : ", ice.get("메로나")) get 사용도 가능

print("----------------------------------------------------------------")
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
ice["메로나"] = 1300
print(ice)

print("----------------------------------------------------------------")
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}

del ice["메로나"]
print(ice)

print("----------------------------------------------------------------")
inventory = {"메로나" : [300, 20], "비비빅" : [400, 3], "죠스바" : [250, 100]}
print(inventory)

print("----------------------------------------------------------------")
inventory = {"메로나": [300, 20],
              "비비빅": [400, 3],
              "죠스바": [250, 100]}

print(inventory["메로나"][0], "원")
print(inventory["메로나"][1], "개")

inventory["월드콘"] = [500, 7]
print(inventory)

print("----------------------------------------------------------------")
icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
names = list(icecream.keys())
print(names)

prices = list(icecream.values())
print(prices)

print("----------------------------------------------------------------")
icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}

# 내가 쓴 답
total = 0
for price in prices:
    total += price
print(total)

# 답지 - sum 함수 사용. 훨씬 간결함
print(sum(icecream.values()))

print("----------------------------------------------------------------")
icecream = {'탱크보이': 1200, '폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
new_product = {'팥빙수':2700, '아맛나':1000}

icecream.update(new_product)
print(icecream)

print("----------------------------------------------------------------")
keys = ("apple", "pear", "peach")
vals = (300, 250, 400)

# zip : 두 개의 리스트 또는 튜플 등을 병렬로 묶어주는 함수
result = dict(zip(keys, vals))
print(result)

print("----------------------------------------------------------------")
date = ['09/05', '09/06', '09/07', '09/08', '09/09']
close_price = [10500, 10300, 10100, 10800, 11000]

close_table = dict(zip(date, close_price))
print(close_table)