print("Hello World")
print("Mary's cosmatic")
print("신씨가 소리질렀다. \"도둑이야\".")
print("C:\\Windows")
print("안녕하세요.\n만나서\t\t반갑습니다.")

print("------------------------------------------------")
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
    print(변수)

list = [100, 200, 300]
for i in list:
    print(i + 10)

menu_list = ["김밥", "라면", "튀김"]

for menu in menu_list:
    # print("오늘의 메뉴 : {0}".format(menu))
    print(f"오늘의 메뉴 : {menu}")

list = ["SK하이닉스", "삼성전자", "LG전자"]
for i in list:
    print(len(i))

animals = ["dog", "cat", "parrot"]
for animal in animals:
    print(f"{animal}", len(animal))
for animal in animals:
    print(animal[0])

list = [1, 2, 3]
for i in list:
    print("3 x", i)

for i in list:
    print("3 x", i, "=", 3*i)

list = ["가", "나", "다", "라"]
for i in list[1:]:
    print(i)

print("----------------------------------------------------------------")

# 리스트 슬라이싱에서 `[시작:끝:증감폭] ` 세번째 값은 값을 가져오는 단위를 의미
for i in list[: :2]:
    print(i)

list = [3, -20, -3, 44]
for i in list:
    if i < 0:
        print(i)

print("----------------------------------------------------------------")

list = [3, 100, 23, 44]
for i in list:
    if i % 3 == 0:
        print(i)

print("----------------------------------------------------------------")

list = [13, 21, 12, 14, 30, 18]
for i in list:
    if i % 3 == 0 and i < 20:
        print(i)

print("----------------------------------------------------------------")

list = ["I", "study", "python", "language", "!"]
for i in list:
    if len(i) >= 3:
        print(i)

print("----------------------------------------------------------------")
list = ["A", "b", "c", "D"]
for i in list:
    if i.isupper() == True:
        print(i)

for i in list:
    if i.isupper() == False:
        print(i)

print("----------------------------------------------------------------")
list = ['dog', 'cat', 'parrot']
for i in list:
    big = i[0].upper()
    print(big + i[1:])

print("----------------------------------------------------------------")
list = ['hello.py', 'ex01.py', 'intro.hwp']
for i in list:
    split = i.split(".") # .을 기준으로 문자열이 분할됨
    print(split[0])

print("----------------------------------------------------------------")
list = ['intra.h', 'intra.c', 'define.h', 'run.py']
for i in list:
    split = i.split(".")
    if split[1] == "h":
        print(i)

print("----------------------------------------------------------------")
list = ['intra.h', 'intra.c', 'define.h', 'run.py']
for i in list:
    split = i.split(".")
    if split[1] == "h" or split[1] == "c":
        print(i)

print("----------------------------------------------------------------")
for i in range(0, 100):
    print(i)
# 참고) range의 세번 째 파라미터는 증감폭을 결정

print("----------------------------------------------------------------")
for i in range(1,31):
    if i % 3 == 0:
        print(i)

print("----------------------------------------------------------------")
for i in range(100):
    print(99 - i)

print("----------------------------------------------------------------")
for i in range(10):
    print(i / 10)

print("----------------------------------------------------------------")
for i in range(1, 10):
    print("3 x", i ,"=", 3*i)

print("----------------------------------------------------------------")
for i in range(1, 10):
    if i % 2 == 1:
        print("3 x", i ,"=", 3*i)

print("----------------------------------------------------------------")
total = 0
for i in range(1, 11):
    total += i
print("합 : ", total) # for문 밖에서 출력

print("----------------------------------------------------------------")
total = 0
for i in range(1, 11):
    if i % 2 == 1:
        total += i
print("합 : ", total)

print("----------------------------------------------------------------")
total = 1 
for i in range(1, 11):
    total *= i
print("값 : ", total)

print("----------------------------------------------------------------")
price_list = [32100, 32150, 32000, 32500]
for i in range(0, 4):
    print(i, price_list[i])

print("----------------------------------------------------------------")
price_list = [32100, 32150, 32000, 32500]
for i in range(0, 4):
    print((3 - i), price_list[i])

print("----------------------------------------------------------------")
price_list = [32100, 32150, 32000, 32500]
for i in range(1, 4):
    print(90 + 10 * i, price_list[i])

print("----------------------------------------------------------------")
my_list = ["가", "나", "다", "라"]
for i in range(1, len(my_list)):
    print(my_list[i - 1], my_list[i])


print("----------------------------------------------------------------")
my_list = ["가", "나", "다", "라", "마"]
for i in range(2, len(my_list)):
    print(my_list[i - 2], my_list[i - 1], my_list[i])

print("----------------------------------------------------------------")
my_list = ["가", "나", "다", "라"]
# for i in range(0, len(my_list)):
#     print(my_list[i + 3], my_list[i + 2])

# 리스트를 역순으로 반복하는 for문 
# 역순 for문에서는 대개의 경우에는 리스트의 마지막 요소를 제외하고 역순으로 순회하는 것이 일반적
for i in range(len(my_list) - 1, 0, -1): # my_list의 길이에서 1을 뺀 값으로 시작(인덱스는 0부터 시작하기때문), 0은 반복문이 끝날 값, -1은 각 반복마다 감소하는 값으로 역순으로 반복하기 위해 -1씩 감소
    print(my_list[i], my_list[i-1])

print("----------------------------------------------------------------")
my_list = [100, 200, 400, 800]
for i in range(1, len(my_list)):
    print(my_list[i] - my_list[i - 1])

print("----------------------------------------------------------------")
my_list = [100, 200, 400, 800, 1000, 1300]
for i in range(2, len(my_list)):
    average = ((my_list[i] + my_list[i - 1] + my_list[i - 2]) / 3)
    print(average)

print("----------------------------------------------------------------")
low_prices  = [100, 200, 400, 800, 1000]
high_prices = [150, 300, 430, 880, 1000]
volatility = []
for i in range(0, len(low_prices)):
    volatility.append(high_prices[i] - low_prices[i])
print(volatility)

print("----------------------------------------------------------------")
apart = [["101호", "102호"], ["201호", "202호"], ["301호", "302호"]]
print(apart)

print("----------------------------------------------------------------")
stock = [["시가", 100, 200, 300], ["종가", 80, 210, 330]]
print(stock)

print("----------------------------------------------------------------")
start = [100, 200, 300]
end = [80, 210, 330]
stock = { "시가" : start, "종가" : end }

print("----------------------------------------------------------------")
stock = { "10/10" : [80, 110, 70, 90], "10/11" : [210, 230, 190, 200]}

print("----------------------------------------------------------------")
apart = [ [101, 102], [201, 202], [301, 302] ]
for row in apart:
    for col in row:
        print(col, "호")

print("----------------------------------------------------------------")
apart = [ [101, 102], [201, 202], [301, 302] ]

for row in apart[::-1]: # 파이썬에서 리스트를 역순으로 순회할 때 사용하는 구문(처음부터 끝까지 거꾸로 가져오라는 의미)
    for col in row:
        print(col, "호")

print("----------------------------------------------------------------")
apart = [ [101, 102], [201, 202], [301, 302] ]

for row in apart[::-1]:
    for col in row[::-1]:
        print(col, "호")

print("----------------------------------------------------------------")
apart = [ [101, 102], [201, 202], [301, 302] ]
for row in apart:
    for col in row:
        print(col, "호\n-----")

print("----------------------------------------------------------------")
apart = [ [101, 102], [201, 202], [301, 302] ]
for row in apart:
    for col in row:
        print(col, "호")
print("-"*5)

print("----------------------------------------------------------------")
data = [
    [ 2000,  3050,  2050,  1980],
    [ 7500,  2050,  2050,  1980],
    [15450, 15050, 15550, 14900]
]

for row in data:
    for col in row:
        print(col * 1.00014)

print("----------------------------------------------------------------")
data = [
    [ 2000,  3050,  2050,  1980],
    [ 7500,  2050,  2050,  1980],
    [15450, 15050, 15550, 14900]
]

for row in data:
    for col in row:
        print(col * 1.00014)
    print("-"*5)

print("----------------------------------------------------------------")
result = []
for row in data: # row에는 한번에 [ 2000,  3050,  2050,  1980] 한 행씩 들어가고 
    for col in row: # col에는 row 내부의 요소들이 하나씩 순회
        result.append(col * 1.00014)
print(result)

print("----------------------------------------------------------------")
result = []
for row in data: # 한 행 단위로 순회
    sub = []
    for col in row: # 한 행 내부의 요소 단위로 순회
        sub.append(col * 1.00014)
    result.append(sub)
print(result)

print("----------------------------------------------------------------")
ohlc = [["open", "high", "low", "close"],
        [100, 110, 70, 100],
        [200, 210, 180, 190],
        [300, 310, 300, 310]]

for row in ohlc[1:]:
    print(row[3])
# 이중 리스트는 각 요소가 인덱스에 의해 접근되는 구조이기 때문에, 딕셔너리처럼 키(key)를 사용하여 데이터에 접근하는 것은 불가능

print("----------------------------------------------------------------")
ohlc = [["open", "high", "low", "close"],
        [100, 110, 70, 100],
        [200, 210, 180, 190],
        [300, 310, 300, 310]]

for row in ohlc[1:]:
    if row[3] > 150:
        print(row[3])

print("----------------------------------------------------------------")
ohlc = [["open", "high", "low", "close"],
        [100, 110, 70, 100],
        [200, 210, 180, 190],
        [300, 310, 300, 310]]

for row in ohlc[1:]:
    if row[3] >= row[0]:
        print(row[3])

print("----------------------------------------------------------------")
ohlc = [["open", "high", "low", "close"],
        [100, 110, 70, 100],
        [200, 210, 180, 190],
        [300, 310, 300, 310]]

volatility = []
for row in ohlc[1:]:
    volatility.append(row[1] - row[2])
print(volatility)

print("----------------------------------------------------------------")
ohlc = [["open", "high", "low", "close"],
        [100, 110, 70, 100],
        [200, 210, 180, 190],
        [300, 310, 300, 310]]

for row in ohlc[1:]:
    if row[3] > row[0]:
        print(row[1] - row[2])

print("----------------------------------------------------------------")
ohlc = [["open", "high", "low", "close"],
        [100, 110, 70, 100],
        [200, 210, 180, 190],
        [300, 310, 300, 310]]
        
total = 0
for row in ohlc[1:]:
    total += (row[0] - row[3])
print(total)