my_variable = ()
print(type(my_variable))

print("----------------------------------------------------------------")
movie_rank = ("닥터 스트레인지", "스플릿", "럭키")
print(movie_rank)

print("----------------------------------------------------------------")
q = (1,)
print(type(q))

print("----------------------------------------------------------------")
interest = ('삼성전자', 'LG전자', 'SK Hynix')
q = list(interest)
print(q)

print("----------------------------------------------------------------")
interest = ['삼성전자', 'LG전자', 'SK Hynix']
t = tuple(interest)
print(t)

print("----------------------------------------------------------------")
my_tuple = tuple(range(2, 100, 2))
print(my_tuple)
